src/cf/src/Documents/СписаниеБезналичныхДенежныхСредств/СписаниеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБезналичныхДенежныхСредств</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеДополнительныхРасходов</basedOn>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоcтавщикамиНалоговый</registerRecords>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречисленияВБюджет</name>
    <type>
      <types>EnumRef.ВидыПеречисленийВБюджет</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщика</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПолучателя</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППлательщика</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППолучателя</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеречислениеВБюджет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСоставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаЗарплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыплатаЗарплаты</types>
      <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеРеглУчета</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеРасходы</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/СписаниеБезналичныхДенежныхСредств/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьВидимостьРеквизитов();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	Если Объект.Ссылка.Пустая() Тогда
		РаботаСВалютами.ЗаполнитьВалютуПлатежа(Объект);
	КонецЕсли;
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РаботаСДокументамиКлиент.ПроверитьСуммуОснованийПлатёжногоДокумента(Объект, Отказ);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеНеоплаченные(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоНеоплаченным(Команда)
	П = ПараметрыПолученияЗадолженности(Истина);
	РаботаСДокументамиКлиент.ОткрытьФормуПодбораОбъектовРасчётовПоОстаткам(ЭтаФорма, П);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежа(Команда)
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьРеквизитыПлательщикаПолучателя();
	ЗаполнитьВалютуНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежногоДокументаПриИзменении(Элемент)
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Объект.Организация);
	Объект.БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
	УстановитьДоговор();
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация,, Объект.Дата);
	Объект.БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
	Объект.Договор = ДанныеКонтрагента.Договор;
	УстановитьДоговор();
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
	УстановитьДоговор();
	Объект.СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(Объект.ХозяйственнаяОперация);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроведеноБанкомПриИзменении(Элемент)
	Объект.ДатаПроведенияБанком = ?(Объект.ПроведеноБанком, ТекущаяДата(), Дата(1,1,1));		
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЧОснованияСтавкаНДС Или Поле = Элементы.ТЧОснованияСуммаНДС Тогда
		ТекСтр = Объект.ТЧОснования.НайтиПоИдентификатору(ВыбраннаяСтрока);
		РаботаСДокументамиКлиент.РедактироватьСуммыНДСПлатёжногоДокумента(ТекСтр, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание,
		РаботаСВалютамиКлиентСервер.ВалютаПлатежа(Объект));
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыОснованияСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(Элементы.ТЧОснования.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияСтавкаНДСПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ТекСтр.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(ТекСтр.СтавкаНДС, ТекСтр.Сумма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЧекПриИзменении(Элемент)
	ЧекПриИзмененииНаСервере();
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияНДСПлатёжногоДокумента(МасДанные, СтрОснованиеПлатежа) Экспорт
	Если МасДанные = Неопределено Тогда Возврат КонецЕсли;
	Модифицированность = Истина;
	РаботаСДокументамиКлиент.ЗаполнитьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, МасДанные);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораОбъектовРасчётов(МасЗадолженность, ДополнительныеПараметры) Экспорт
	Если МасЗадолженность = Неопределено Тогда Возврат КонецЕсли;
	ЗаполнитьПоОстаткамНаСервере(Истина, МасЗадолженность);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ПараметрыПолученияЗадолженности(ВсеНеоплаченные)
	Возврат РаботаСДокументами.ПараметрыПолученияЗадолженности(Объект, Истина, ВсеНеоплаченные);	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	РаботаСДокументами.УстановитьВидимостьРеквизитовДенежногоДокумента(ЭтаФорма);
	Элементы.ПериодРасчетаЗарплаты.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты;
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств  
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда 
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.Договор.Видимость = Ложь;
		Элементы.МестоХранения.Видимость = Не Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека;
	КонецЕсли;
	Элементы.МестоХранения.ТолькоПросмотр = РольДоступна("PDV");
	Элементы.Организация.ТолькоПросмотр = РольДоступна("PDV");
	Элементы.Чек.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека;
КонецПроцедуры	

&НаСервере
Процедура УстановитьРеквизитыПлательщикаПолучателя()
	Документы.СписаниеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(Объект);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные, Знач МасЗадолженность = Неопределено)
	П = ПараметрыПолученияЗадолженности(ВсеНеоплаченные);
	РаботаСДокументами.ЗаполнитьЗадолженностьДляЗакрытия(Объект, П, МасЗадолженность);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоговор()
	РаботаСДокументами.УстановитьДоговорДляПлатёжногоДокумента(Объект);		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПлатежаНаСервере()
	Обработки.КлиентБанк.СформироватьТекстНазначенияПлатежа(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаРасходованиеДенежныхСредствПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаРасходованиеДенежныхСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОткрытьФормуВыбораЗаявкиНаРасходованиеДС(Объект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЧекПриИзмененииНаСервере()
	Объект.Сумма = ?(Объект.Чек.Пустая(), 0, Объект.Чек.СуммаЧека);
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	Объект.СуммаВВалютеРеглУчета = РаботаСВалютамиКлиентСервер.СуммаРегл(Объект.Сумма,
		РаботаСВалютамиКлиентСервер.КурсПлатежа(Объект));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	ЗаполнитьВалютуНаСервере(Ложь);
	ПослеСменыКурса();
КонецПроцедуры

// Валюта платёжного документа - валюта кассы или счёта, курс - на дату (docs/plans/multicurrency-payments.md).

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	ПослеСменыКурса();
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыКурса()
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

// Валюта и курс по кассе или счёту и дате. Сменилась валюта - суммы документа и строк переводятся в новую
// валюту через основную (курс основной валюты - 1); курса новой валюты нет - суммы не трогаются. Записанный
// документ без валюты (до оплат в валюте) - в основной валюте; смена даты меняет только курс.
//
// Параметры:
//  ОбновитьКурс - Булево - Истина: смена даты - курс берётся из регистра заново, валюта не меняется.
//
&НаСервере
Процедура ЗаполнитьВалютуНаСервере(Знач ОбновитьКурс)
	Основная = РаботаСВалютами.ОсновнаяВалюта();
	Если Не ЗначениеЗаполнено(Объект.Валюта) И Не Объект.Ссылка.Пустая() Тогда
		Объект.Валюта = Основная;
		Объект.КурсВалюты = 1;
	КонецЕсли;
	Если ОбновитьКурс И ЗначениеЗаполнено(Объект.Валюта) Тогда
		Если Объект.Валюта <> Основная Тогда
			Объект.КурсВалюты = РаботаСВалютами.КурсВалюты(Объект.Валюта, Объект.Дата);
		КонецЕсли;
		УстановитьВидимостьВалюты();
		Возврат;
	КонецЕсли;
	ПрежняяВалюта = ?(ЗначениеЗаполнено(Объект.Валюта), Объект.Валюта, Основная);
	ПрежнийКурс = РаботаСВалютамиКлиентСервер.КурсПлатежа(Объект);
	РаботаСВалютами.ЗаполнитьВалютуПлатежа(Объект, ОбновитьКурс);
	Если ПрежняяВалюта <> Объект.Валюта И Объект.КурсВалюты > 0 Тогда
		Коэффициент = ПрежнийКурс / Объект.КурсВалюты;
		Объект.Сумма = РаботаСВалютамиКлиентСервер.СуммаРегл(Объект.Сумма, Коэффициент);
		Для Каждого Стр Из Объект.ТЧОснования Цикл
			Стр.Сумма = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, Коэффициент);
			Стр.СуммаНДС = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.СуммаНДС, Коэффициент);
		КонецЦикла;
	КонецЕсли;
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Курс виден у кассы или счёта в валюте, сумма подписана валютой; валюта задаётся кассой или счётом.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = РаботаСВалютами.ВалютаИКурсДокумента(Объект).ВВалюте;
	Элементы.Валюта.ТолькоПросмотр = Истина;
	Элементы.КурсВалюты.Видимость = ВВалюте;
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	Элементы.Сумма.Заголовок = ?(ВВалюте, РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта), "");
КонецПроцедуры

#КонецОбласти
